app/views/devise/registrations/edit.html.erb

        <%= f.label :city_id %>
        <%= f.collection_select(:city_id, City.all, :id, :name, include_blank: true) %>
---
SELECT "cities".* FROM "cities"