app/views/visitors/index.html.erb

SELECT COUNT(*) FROM "users"
---
<%= javascript_tag "alert_name('#{current_user.name}')" if current_user %>
<p><%= link_to 'Users:', users_path %> <%= User.count %> registered</p>