app/views/users/show.html.erb

<p>Age: <%= @user.age if @user.age %></p>
<p>City: <%= City.all.find(@user.city_id).name if @user.city_id %></p>
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT 1  [["id", 8]]