app/controllers/cities_controller.rb

  def show
    @city = City.find params[:id]
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @city = City.new(city_params)

    if @city.save
---
INSERT INTO "cities" ("name", "short_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Warsaw"], ["short_name", "Ww"], ["created_at", "2015-02-25 16:15:23.023241"], ["updated_at", "2015-02-25 16:15:23.023241"]]

  def destroy
    @city = City.find params[:id]
    @city.destroy
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT 1  [["id", 0]]
DELETE FROM "cities" WHERE "cities"."id" = ?  [["id", 2]]